RT-Thread/rt-thread/bsp/stm32_radio/Libraries/STM32_USB-FS-Device_Driver/inc/otgd_fs_regs.h
/******************** (C) COPYRIGHT 2009 STMicroelectronics ********************
* File Name          : otgd_fs_regs.h
* Author             : STMicroelectronics
* Version            : V3.1.0
* Date               : 10/30/2009
* Description        : USB OTG IP hardware registers.
********************************************************************************
* THE PRESENT SOFTWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

#ifndef __USB_OTG_REGS_H__
#define __USB_OTG_REGS_H__

#ifdef STM32F10X_CL

#include "stm32f10x.h"
#include "usb_type.h"

#define USB_OTG_FS1_BASE_ADDR                0x50000000

#define USB_OTG_CORE_GLOBAL_REGS_OFFSET      0x000
#define USB_OTG_DEV_GLOBAL_REG_OFFSET        0x800
#define USB_OTG_DEV_IN_EP_REG_OFFSET         0x900
#define USB_OTG_EP_REG_OFFSET                0x20
#define USB_OTG_DEV_OUT_EP_REG_OFFSET        0xB00
#define USB_OTG_HOST_GLOBAL_REG_OFFSET       0x400
#define USB_OTG_HOST_PORT_REGS_OFFSET        0x440
#define USB_OTG_HOST_CHAN_REGS_OFFSET        0x500
#define USB_OTG_CHAN_REGS_OFFSET             0x20
#define USB_OTG_PCGCCTL_OFFSET               0xE00
#define USB_OTG_DATA_FIFO_OFFSET             0x1000
#define USB_OTG_DATA_FIFO_SIZE               0x1000

#define MAX_PERIO_FIFOS                      8
#define MAX_TX_FIFOS                         4
#define MAX_EPS_CHANNELS                     8

#define DEV_NP_TX_FIFO_SIZE                  160
#define RX_FIFO_SIZE                         160
#define TX_FIFO_SIZE                         160

/*******************************************************************************
 * USB_OTG Core registers .
 * The USB_OTG_core_regs structure defines the size
 * and relative field offsets for the Core Global registers.
 ******************************************************************************/
typedef struct _USB_OTG_common_regs  //000h
{

  __IO uint32_t otg_ctl;      /* USB_OTG Control and Status Register    000h*/
  __IO uint32_t otg_int;      /* USB_OTG Interrupt Register             004h*/
  __IO uint32_t ahb_cfg;      /* Core AHB Configuration Register    008h*/
  __IO uint32_t usb_cfg;      /* Core USB Configuration Register    00Ch*/
  __IO uint32_t rst_ctl;      /* Core Reset Register                010h*/
  __IO uint32_t int_sts;      /* Core Interrupt Register            014h*/
  __IO uint32_t int_msk;      /* Core Interrupt Mask Register       018h*/
  __IO uint32_t rx_stsr;      /* Receive Sts Q Read Register        01Ch*/
  __IO uint32_t rx_stsp;      /* Receive Sts Q Read & POP Register  020h*/
  __IO uint32_t rx_fifo_siz;  /* Receive FIFO Size Register         024h*/
  __IO uint32_t np_tx_fifo_siz;   /* Non Periodic Tx FIFO Size Register 028h*/
  __IO uint32_t np_tx_sts;    /* Non Periodic Tx FIFO/Queue Sts reg 02Ch*/
  __IO uint32_t i2c_ctl;      /* I2C Access Register                030h*/
  __IO uint32_t phy_vnd_ctl;  /* PHY Vendor Control Register        034h*/
  __IO uint32_t gpio;         /* General Purpose IO Register        038h*/
  __IO uint32_t usr_id;       /* User ID Register                   03Ch*/
  __IO uint32_t snps_id;      /* Synopsys ID Register               040h*/
  __IO uint32_t hw_cfg1;      /* User HW Config1 Register (RO)      044h*/
  __IO uint32_t hw_cfg2;      /* User HW Config2 Register (RO)      048h*/
  __IO uint32_t hw_cfg3;      /* User HW Config3 Register (RO)      04Ch*/
  __IO uint32_t hw_cfg4;      /* User HW Config4 Register (RO)      050h*/
  uint32_t  reserved[43];          /* Reserved                      054h-0FFh*/
  __IO uint32_t host_p_tx_fifo_siz; /* Host Periodic Tx FIFO Size Reg     100h*/
  __IO uint32_t dev_p_tx_fsiz_dieptxf[15];/* dev Periodic Transmit FIFO */

}
USB_OTG_common_regs;

/*******************************************************************************
 * dev Registers
 * dev Global Registers : Offsets 800h-BFFh
 * The following structures define the size and relative field offsets
 * for the dev Mode Registers.
 * These registers are visible only in dev mode and must not be
 * accessed in Host mode, as the results are unknown
 ******************************************************************************/
typedef struct _USB_OTG_dev_regs // 800h
{

  __IO uint32_t dev_cfg;         /* dev Configuration Register   800h*/
  __IO uint32_t dev_ctl;         /* dev Control Register         804h*/
  __IO uint32_t dev_sts;         /* dev Status Register (RO)     808h*/
  uint32_t reserved3;         /* Reserved                     80Ch*/
  __IO uint32_t dev_in_ep_msk;   /* dev IN Endpoint Mask         810h*/
  __IO uint32_t dev_out_ep_msk;  /* dev OUT Endpoint Mask        814h*/
  __IO uint32_t dev_all_int;     /* dev All Endpoints Itr Reg    818h*/
  __IO uint32_t dev_all_int_msk; /* dev All Endpoints Itr Mask   81Ch*/
  uint32_t  Reserved8;       /* Reserved                     820h*/
  __IO uint32_t Reserved9;       /* Reserved                     824h*/
  __IO uint32_t dev_vbus_dis;    /* dev VBUS discharge Register  828h*/
  __IO uint32_t dev_vbus_pulse;  /* dev VBUS Pulse Register      82Ch*/
  __IO uint32_t dev_thr_ctl;     /* dev thr                      830h*/
  __IO uint32_t dev_fifo_empty_msk; /* dev empty msk             834h*/

}
USB_OTG_dev_regs;
/*******************************************************************************
 * dev Logical IN Endpoint-Specific Registers: Offsets 900h-AFCh
 * There will be one set of endpoint registers per logical endpointimplemented.
 * These registers are visible only in dev mode and must not be
 * accessed in Host mode, as the results are unknown
*******************************************************************************/
typedef struct _USB_OTG_dev_in_ep_regs
{
  __IO uint32_t dev_in_ep_ctl; /* dev IN Endpoint Control Reg 900h + (ep_num * 20h) + 00h*/
  uint32_t reserved04;             /* Reserved                       900h + (ep_num * 20h) + 04h*/
  __IO uint32_t dev_in_ep_int; /* dev IN Endpoint Itr Reg     900h + (ep_num * 20h) + 08h*/
  uint32_t reserved0C;             /* Reserved                       900h + (ep_num * 20h) + 0Ch*/
  __IO uint32_t dev_in_ep_txfer_siz; /* IN Endpoint Txfer Size   900h + (ep_num * 20h) + 10h*/
  __IO uint32_t dev_in_ep_dma; /* IN Endpoint DMA Address Reg    900h + (ep_num * 20h) + 14h*/
  __IO uint32_t dev_tx_fifo_sts;/*IN Endpoint Tx FIFO Status Reg 900h + (ep_num * 20h) + 18h*/
  uint32_t reserved18;             /* Reserved  900h+(ep_num*20h)+1Ch-900h+ (ep_num * 20h) + 1Ch*/

