RT-Thread/rt-thread/bsp/stm32_radio/Libraries/STM32_USB-FS-Device_Driver/inc/otgd_fs_regs.h
typedef union _USB_OTG_rst_ctl_data
{
  uint32_t d32;
  struct
  {
uint32_t csftrst :
    1;
uint32_t hsftrst :
    1;
uint32_t hstfrm :
    1;
uint32_t intknqflsh :
    1;
uint32_t rxfflsh :
    1;
uint32_t txfflsh :
    1;
uint32_t txfnum :
    5;
uint32_t reserved11_29 :
    19;
uint32_t dmareq :
    1;
uint32_t ahbidle :
    1;
  }
  b;
} USB_OTG_rst_ctl_data;

/******************************************************************************/

typedef union _USB_OTG_int_msk_data
{
  uint32_t d32;
  struct
  {
uint32_t reserved0 :
    1;
uint32_t modemismatch :
    1;
uint32_t otgintr :
    1;
uint32_t sofintr :
    1;
uint32_t rxstsqlvl :
    1;
uint32_t nptxfempty :
    1;
uint32_t ginnakeff :
    1;
uint32_t goutnakeff :
    1;
uint32_t reserved8 :
    1;
uint32_t i2cintr :
    1;
uint32_t erlysuspend :
    1;
uint32_t usbsuspend :
    1;
uint32_t usbreset :
    1;
uint32_t enumdone :
    1;
uint32_t isooutdrop :
    1;
uint32_t eopframe :
    1;
uint32_t reserved16 :
    1;
uint32_t epmismatch :
    1;
uint32_t inepintr :
    1;
uint32_t outepintr :
    1;
uint32_t incomplisoin :
    1;
uint32_t incomplisoout :
    1;
uint32_t reserved22_23 :
    2;
uint32_t portintr :
    1;
uint32_t hcintr :
    1;
uint32_t ptxfempty :
    1;
uint32_t reserved27 :
    1;
uint32_t conidstschng :
    1;
uint32_t disconnect :
    1;
uint32_t sessreqintr :
    1;
uint32_t wkupintr :
    1;
  }
  b;
} USB_OTG_int_msk_data;

/******************************************************************************/


typedef union _USB_OTG_int_sts_data
{
  uint32_t d32;
  struct
  {
uint32_t curmode :
    1;
uint32_t modemismatch :
    1;
uint32_t otgintr :
    1;
uint32_t sofintr :
    1;
uint32_t rxstsqlvl :
    1;
uint32_t nptxfempty :
    1;
uint32_t ginnakeff :
    1;
uint32_t goutnakeff :
    1;
uint32_t reserved8 :
    1;
uint32_t i2cintr :
    1;
uint32_t erlysuspend :
    1;
uint32_t usbsuspend :
    1;
uint32_t usbreset :
    1;
uint32_t enumdone :
    1;
uint32_t isooutdrop :
    1;
uint32_t eopframe :
    1;
uint32_t intokenrx :
    1;
uint32_t epmismatch :
    1;
uint32_t inepint:
    1;
uint32_t outepintr :
    1;
uint32_t incomplisoin :
    1;
uint32_t incomplisoout :
    1;
uint32_t reserved22_23 :
    2;
uint32_t portintr :
    1;
uint32_t hcintr :
    1;
uint32_t ptxfempty :
    1;
uint32_t reserved27 :
    1;
uint32_t conidstschng :
    1;
uint32_t disconnect :
    1;
uint32_t sessreqintr :
    1;
uint32_t wkupintr :
    1;
  }
  b;
} USB_OTG_int_sts_data;

/******************************************************************************/
typedef union _USB_OTG_dev_rx_sts_data
{

  uint32_t d32;
  struct
  {
uint32_t epnum :
    4;
uint32_t bcnt :
    11;
uint32_t dpid :
    2;
uint32_t pktsts :
    4;
uint32_t fn :
    4;
uint32_t reserved :
    7;
  }
  b;
} USB_OTG_dev_rx_sts_data;

/******************************************************************************/
typedef union _USB_OTG_host_rx_sts_data
{

  uint32_t d32;
  struct
  {
uint32_t chnum :
    4;
uint32_t bcnt :
    11;
uint32_t dpid :
    2;
uint32_t pktsts :
    4;
uint32_t reserved :
    11;
  }
  b;
} USB_OTG_host_rx_sts_data;

/******************************************************************************/

typedef union _USB_OTG_fifo_size_data
{
  uint32_t d32;
  struct
  {
uint32_t startaddr :
    16;
uint32_t depth :
    16;
  }
  b;
} USB_OTG_fifo_size_data;

/******************************************************************************/

typedef union _USB_OTG_np_tx_sts_data
{
  uint32_t d32;
  struct
  {
uint32_t nptxfspcavail :
    16;
uint32_t nptxqspcavail :
    8;
uint32_t nptxqtop_terminate :
    1;
uint32_t nptxqtop_token :
    2;
uint32_t nptxqtop_chnep :
    4;
uint32_t reserved :
    1;
  }
  b;
} USB_OTG_np_tx_sts_data;

/******************************************************************************/

typedef union _USB_OTG_dev_tx_fifo_sts_data
{
  uint32_t d32;
  struct
  {
uint32_t txfspcavail :
    16;
uint32_t reserved :
    16;
  }
  b;
} USB_OTG_dev_tx_fifo_sts_data;

/******************************************************************************/
typedef union _USB_OTG_i2c_ctl_data
{

  uint32_t d32;
  struct
  {
uint32_t rwdata :
    8;
uint32_t regaddr :
    8;
uint32_t addr :
    7;
uint32_t i2cen :
    1;
uint32_t ack :
    1;
uint32_t i2csuspctl :
    1;
uint32_t i2cdevaddr :
    2;
uint32_t dat_se0:
    1;
uint32_t reserved :
    1;
uint32_t rw :
    1;
uint32_t bsydne :
    1;
  }
  b;
} USB_OTG_i2c_ctl_data;

/******************************************************************************/

typedef union _USB_OTG_gpio_data
{

  uint32_t d32;
  struct
  {
    /* input */
uint32_t ovrcur :
    1;
uint32_t otgid :
    1;
uint32_t reserved_in :
    14;
    /* Output */
uint32_t pwdn :
    1;
uint32_t i2cifen :
    1;
uint32_t vbussensingA :
    1;
uint32_t vbussensingB :
    1;
uint32_t SOFouten :
    1;
uint32_t reserved_out :
    11;
  }
  b;
} USB_OTG_gpio_data;


/******************************************************************************/

typedef union _USB_OTG_hw_cfg1_data
{

  uint32_t d32;
  struct
  {
uint32_t ep_dir0 :
    2;
uint32_t ep_dir1 :
    2;
uint32_t ep_dir2 :
    2;
uint32_t ep_dir3 :
    2;
uint32_t ep_dir4 :
    2;
uint32_t ep_dir5 :
    2;
uint32_t ep_dir6 :
    2;
uint32_t ep_dir7 :
    2;
uint32_t ep_dir8 :
    2;
uint32_t ep_dir9 :
    2;
uint32_t ep_dir10 :
    2;
uint32_t ep_dir11 :
    2;
uint32_t ep_dir12 :
    2;
uint32_t ep_dir13 :
    2;
uint32_t ep_dir14 :
    2;
uint32_t ep_dir15 :
    2;
  }
  b;
} USB_OTG_hw_cfg1_data;

/******************************************************************************/
typedef union _USB_OTG_hw_cfg2_data
{
  uint32_t d32;
  struct
  {
uint32_t op_mode :
    3;
uint32_t architecture :
    2;
uint32_t point2point :
    1;
uint32_t hs_phy_type :
    2;
uint32_t fs_phy_type :
    2;
uint32_t num_dev_ep :
    4;
uint32_t num_host_chan :
    4;
uint32_t perio_ep_supported :
    1;
uint32_t dynamic_fifo :
    1;
uint32_t rx_status_q_depth :
    2;
uint32_t nonperio_tx_q_depth :
    2;
uint32_t host_perio_tx_q_depth :
    2;
uint32_t dev_token_q_depth :
    5;
uint32_t reserved31 :
    1;
  }
  b;
} USB_OTG_hw_cfg2_data;

/******************************************************************************/

typedef union _USB_OTG_hw_cfg3_data
{

  uint32_t d32;
  struct
  {
uint32_t xfer_size_cntr_width :
    4;
uint32_t packet_size_cntr_width :
    3;
uint32_t otg_func :
    1;
uint32_t i2c :
    1;
uint32_t vendor_ctrl_if :
    1;
uint32_t optional_features :
    1;
uint32_t synch_reset_type :
    1;
uint32_t ahb_phy_clock_synch :
    1;
uint32_t reserved15_13 :
    3;
uint32_t dfifo_depth :
    16;
  }
  b;
} USB_OTG_hw_cfg3_data;

/******************************************************************************/

typedef union _USB_OTG_hw_cfg4_data
{
  uint32_t d32;
  struct
  {
uint32_t num_dev_perio_in_ep :
    4;
uint32_t power_optimiz :
    1;
uint32_t min_ahb_freq :
    9;
uint32_t utmi_phy_data_width :
    2;
uint32_t num_dev_mode_ctrl_ep :
    4;
uint32_t iddig_filt_en :
    1;
uint32_t vbus_valid_filt_en :
    1;
uint32_t a_valid_filt_en :
    1;
uint32_t b_valid_filt_en :
    1;
uint32_t session_end_filt_en :
    1;
uint32_t ded_fifo_en :
    1;
uint32_t num_in_eps :
    4;
uint32_t reserved31_30 :
    2;
  }
  b;
} USB_OTG_hw_cfg4_data;

/******************************************************************************/
typedef union _USB_OTG_dev_cfg_data
{

  uint32_t d32;
  struct
  {
uint32_t devspd :
    2;
uint32_t nzstsouthshk :
    1;
uint32_t reserved3 :
    1;
uint32_t devaddr :
    7;
uint32_t perfrint :
    2;
uint32_t reserved13_17 :
    5;
uint32_t epmscnt :
    4;
  }
  b;
} USB_OTG_dev_cfg_data;

/******************************************************************************/

typedef union _USB_OTG_dev_ctl_data
{

  uint32_t d32;
  struct
  {
uint32_t rmtwkupsig :
    1;
uint32_t sftdiscon :
    1;
uint32_t gnpinnaksts :
    1;
uint32_t goutnaksts :
    1;
uint32_t tstctl :
    3;
uint32_t sgnpinnak :
    1;
uint32_t cgnpinnak :
    1;
uint32_t sgoutnak :
    1;
uint32_t cgoutnak :
    1;
uint32_t reserved :
    21;
  }
  b;
} USB_OTG_dev_ctl_data;

/******************************************************************************/
typedef union _USB_OTG_dev_sts_data
{

  uint32_t d32;
  struct
  {
uint32_t suspsts :
    1;
uint32_t enumspd :
    2;
uint32_t errticerr :
    1;
uint32_t reserved4_7:
    4;
uint32_t soffn :
    14;
uint32_t reserved22_31 :
    10;
  }
  b;
} USB_OTG_dev_sts_data;

/******************************************************************************/

typedef union _USB_OTG_dev_in_ep_int_data
{

  uint32_t d32;
  struct
  {
uint32_t xfercompl :
    1;
uint32_t epdisabled :
    1;
uint32_t ahberr :
    1;
uint32_t timeout :
    1;
uint32_t intktxfemp :
    1;
uint32_t intknepmis :
    1;
uint32_t inepnakeff :
    1;
uint32_t emptyintr :
    1;
uint32_t txfifoundrn :
    1;
uint32_t reserved08_31 :
    23;
  }
  b;
} USB_OTG_dev_in_ep_int_data;

/******************************************************************************/

typedef union _USB_OTG_dev_in_ep_int_data  USB_OTG_dev_in_ep_msk_data;
/******************************************************************************/

