RT-Thread/rt-thread/bsp/stm32_radio/Libraries/STM32_USB-FS-Device_Driver/inc/otgd_fs_regs.h
typedef union _USB_OTG_dev_out_ep_int_data
{

  uint32_t d32;
  struct
  {
uint32_t xfercompl :
    1;
uint32_t epdisabled :
    1;
uint32_t ahberr :
    1;
uint32_t setup :
    1;
uint32_t reserved04_31 :
    28;
  }
  b;
} USB_OTG_dev_out_ep_int_data;

/******************************************************************************/

typedef union _USB_OTG_dev_out_ep_int_data  USB_OTG_dev_out_ep_msk_data;

/******************************************************************************/
typedef union _USB_OTG_dev_all_int_data
{

  uint32_t d32;
  struct
  {
uint32_t in :
    16;
uint32_t out :
    16;
  }
  ep;
  struct
  {
    /** IN Endpoint bits */
uint32_t inep0  :
    1;
uint32_t inep1  :
    1;
uint32_t inep2  :
    1;
uint32_t inep3  :
    1;
uint32_t inep4  :
    1;
uint32_t inep5  :
    1;
uint32_t inep6  :
    1;
uint32_t inep7  :
    1;
uint32_t inep8  :
    1;
uint32_t inep9  :
    1;
uint32_t inep10 :
    1;
uint32_t inep11 :
    1;
uint32_t inep12 :
    1;
uint32_t inep13 :
    1;
uint32_t inep14 :
    1;
uint32_t inep15 :
    1;
    /** OUT Endpoint bits */
uint32_t outep0  :
    1;
uint32_t outep1  :
    1;
uint32_t outep2  :
    1;
uint32_t outep3  :
    1;
uint32_t outep4  :
    1;
uint32_t outep5  :
    1;
uint32_t outep6  :
    1;
uint32_t outep7  :
    1;
uint32_t outep8  :
    1;
uint32_t outep9  :
    1;
uint32_t outep10 :
    1;
uint32_t outep11 :
    1;
uint32_t outep12 :
    1;
uint32_t outep13 :
    1;
uint32_t outep14 :
    1;
uint32_t outep15 :
    1;
  }
  b;
} USB_OTG_dev_all_int_data;

/******************************************************************************/
typedef union _USB_OTG_token_qr1_data
{

  uint32_t d32;
  struct
  {
uint32_t intknwptr :
    5;
uint32_t reserved05_06 :
    2;
uint32_t wrap_bit :
    1;
uint32_t epnums0_5 :
    24;
  }
  b;
} USB_OTG_token_qr1_data;

/******************************************************************************/

typedef union _USB_OTG_dev_thr_ctl_data
{

  uint32_t d32;
  struct
  {
uint32_t non_iso_thr_en :
    1;
uint32_t iso_thr_en :
    1;
uint32_t tx_thr_len :
    9;
uint32_t reserved11_15 :
    5;
uint32_t rx_thr_en :
    1;
uint32_t rx_thr_len :
    9;
uint32_t reserved26_31 :
    6;
  }
  b;
} USB_OTG_dev_thr_ctl_data;

/******************************************************************************/
typedef union _USB_OTG_dev_ep_ctl_data
{

  uint32_t d32;
  struct
  {
uint32_t mps :
    11;
uint32_t nextep :
    4;
uint32_t usbactep :
    1;
uint32_t dpid :
    1;
uint32_t naksts :
    1;
uint32_t eptype :
    2;
uint32_t snp :
    1;
uint32_t stall :
    1;
uint32_t txfnum :
    4;
uint32_t cnak :
    1;
uint32_t snak :
    1;
uint32_t setd0pid :
    1;
uint32_t setd1pid :
    1;
uint32_t epdis :
    1;
uint32_t epena :
    1;
  }
  b;
} USB_OTG_dev_ep_ctl_data;

/******************************************************************************/

typedef union _USB_OTG_dev_ep_txfer_siz_data
{

  uint32_t d32;
  struct
  {
uint32_t xfersize :
    19;
uint32_t pktcnt :
    10;
uint32_t mc :
    2;
uint32_t reserved :
    1;
  }
  b;
} USB_OTG_dev_ep_txfer_siz_data;

/******************************************************************************/

typedef union _USB_OTG_dev_ep_txfer_size0_data
{

  uint32_t d32;
  struct
  {
uint32_t xfersize :
    7;
uint32_t reserved7_18 :
    12;
uint32_t pktcnt :
    1;
uint32_t reserved20_28 :
    9;
uint32_t supcnt :
    2;
    uint32_t reserved31;
  }
  b;
} USB_OTG_dev_ep_txfer_size0_data;

/******************************************************************************/
typedef union _USB_OTG_host_cfg_data
{

  uint32_t d32;
  struct
  {
uint32_t fslspclksel :
    2;
uint32_t fslssupp :
    1;
  }
  b;
} USB_OTG_host_cfg_data;

/******************************************************************************/

typedef union _USB_OTG_Host_frm_intrvl_data
{
  uint32_t d32;
  struct
  {
uint32_t frint :
    16;
uint32_t reserved :
    16;
  }
  b;
} USB_OTG_Host_frm_intrvl_data;

/******************************************************************************/
#define HFNUM_MAX_FRNUM 0x3FFF
typedef union _USB_OTG_host_frm_nbr_data
{

  uint32_t d32;
  struct
  {
uint32_t frnum :
    16;
uint32_t frrem :
    16;
  }
  b;
} USB_OTG_host_frm_nbr_data;

/******************************************************************************/

typedef union _USB_OTG_host_perio_tx_sts_data
{

  uint32_t d32;
  struct
  {
uint32_t ptxfspcavail :
    16;
uint32_t ptxqspcavail :
    8;
uint32_t ptxqtop_terminate :
    1;
uint32_t ptxqtop_token :
    2;
uint32_t ptxqtop_chnum :
    4;
uint32_t ptxqtop_odd :
    1;
  }
  b;
} USB_OTG_host_perio_tx_sts_data;

/******************************************************************************/
typedef union _USB_OTG_hprt0_data
{
  uint32_t d32;
  struct
  {
uint32_t prtconnsts :
    1;
uint32_t prtconndet :
    1;
uint32_t prtena :
    1;
uint32_t prtenchng :
    1;
uint32_t prtovrcurract :
    1;
uint32_t prtovrcurrchng :
    1;
uint32_t prtres :
    1;
uint32_t prtsusp :
    1;
uint32_t prtrst :
    1;
uint32_t reserved9 :
    1;
uint32_t prtlnsts :
    2;
uint32_t prtpwr :
    1;
uint32_t prttstctl :
    4;
uint32_t prtspd :
    2;
uint32_t reserved19_31 :
    13;
  }
  b;
} USB_OTG_hprt0_data;

/******************************************************************************/

typedef union _USB_OTG_host_all_int_data
{
  uint32_t d32;
  struct
  {
uint32_t ch0 :
    1;
uint32_t ch1 :
    1;
uint32_t ch2 :
    1;
uint32_t ch3 :
    1;
uint32_t ch4 :
    1;
uint32_t ch5 :
    1;
uint32_t ch6 :
    1;
uint32_t ch7 :
    1;
uint32_t ch8 :
    1;
uint32_t ch9 :
    1;
uint32_t ch10 :
    1;
uint32_t ch11 :
    1;
uint32_t ch12 :
    1;
uint32_t ch13 :
    1;
uint32_t ch14 :
    1;
uint32_t ch15 :
    1;
uint32_t reserved :
    16;
  }
  b;

  struct
  {
uint32_t chint :
    16;
uint32_t reserved :
    16;
  }
  b2;
} USB_OTG_host_all_int_data;


/******************************************************************************/

