RT-Thread/rt-thread/bsp/stm32_radio/Libraries/STM32_USB-FS-Device_Driver/inc/otgd_fs_regs.h
typedef union _USB_OTG_host_all_int_msk_data
{
  uint32_t d32;
  struct
  {
uint32_t ch0 :
    1;
uint32_t ch1 :
    1;
uint32_t ch2 :
    1;
uint32_t ch3 :
    1;
uint32_t ch4 :
    1;
uint32_t ch5 :
    1;
uint32_t ch6 :
    1;
uint32_t ch7 :
    1;
uint32_t ch8 :
    1;
uint32_t ch9 :
    1;
uint32_t ch10 :
    1;
uint32_t ch11 :
    1;
uint32_t ch12 :
    1;
uint32_t ch13 :
    1;
uint32_t ch14 :
    1;
uint32_t ch15 :
    1;
uint32_t reserved :
    16;
  }
  b;

  struct
  {
uint32_t chint :
    16;
uint32_t reserved :
    16;
  }
  b2;
} USB_OTG_host_all_int_msk_data;

/******************************************************************************/

typedef union _USB_OTG_hc_char_data
{

  uint32_t d32;
  struct
  {
uint32_t mps :
    11;
uint32_t epnum :
    4;
uint32_t epdir :
    1;
uint32_t reserved :
    1;
uint32_t lspddev :
    1;
uint32_t eptype :
    2;
uint32_t multicnt :
    2;
uint32_t devaddr :
    7;
uint32_t oddfrm :
    1;
uint32_t chdis :
    1;
uint32_t chen :
    1;
  }
  b;
} USB_OTG_hc_char_data;

/******************************************************************************/
typedef union _USB_OTG_hc_splt_data
{

  uint32_t d32;
  struct
  {
uint32_t prtaddr :
    7;
uint32_t hubaddr :
    7;
uint32_t xactpos :
    2;
uint32_t compsplt :
    1;
uint32_t reserved :
    14;
uint32_t spltena :
    1;
  }
  b;
} USB_OTG_hc_splt_data;

/******************************************************************************/

typedef union _USB_OTG_hc_int_data
{
  uint32_t d32;
  struct
  {
uint32_t xfercomp :
    1;
uint32_t chhltd :
    1;
uint32_t ahberr :
    1;
uint32_t stall :
    1;
uint32_t nak :
    1;
uint32_t ack :
    1;
uint32_t nyet :
    1;
uint32_t xacterr :
    1;
uint32_t bblerr :
    1;
uint32_t frmovrun :
    1;
uint32_t datatglerr :
    1;
uint32_t reserved :
    21;
  }
  b;
} USB_OTG_hc_int_data;

/******************************************************************************/


typedef union _USB_OTG_hc_txfer_siz_data
{

  uint32_t d32;
  struct
  {
uint32_t xfersize :
    19;
uint32_t pktcnt :
    10;
uint32_t pid :
    2;
uint32_t dopng :
    1;
  }
  b;
} USB_OTG_hc_txfer_siz_data;

/******************************************************************************/

typedef union _USB_OTG_hc_int_msk_data
{

  uint32_t d32;
  struct
  {
uint32_t xfercompl :
    1;
uint32_t chhltd :
    1;
uint32_t ahberr :
    1;
uint32_t stall :
    1;
uint32_t nak :
    1;
uint32_t ack :
    1;
uint32_t nyet :
    1;
uint32_t xacterr :
    1;
uint32_t bblerr :
    1;
uint32_t frmovrun :
    1;
uint32_t datatglerr :
    1;
uint32_t reserved :
    21;
  }
  b;
} USB_OTG_hc_int_msk_data;

/******************************************************************************/

typedef union _USB_OTG_host_pcgcctl_data
{
  uint32_t d32;
  struct
  {
uint32_t stoppclk :
    1;
uint32_t gatehclk :
    1;
uint32_t pwrclmp :
    1;
uint32_t rstpdwnmodule :
    1;
uint32_t physuspended :
    1;
uint32_t reserved :
    27;
  }
  b;
} USB_OTG_host_pcgcctl_data;

#endif /* STM32F10X_CL */

/******************* (C) COPYRIGHT 2009 STMicroelectronics *****END OF FILE****/

#endif
